# ORM(Object-Relational Mapping)
- 객체와 관계형 DB의 데이터를 자동으로 매핑해주는 것을 말한다. ORM을 통해 객체 간의 관계를 바탕으로  SQL을 자동으로 생성하여 객체 모델과 관계형 모델 간에 불일치를 해결한다. (Persistant API라 부르며 대표적으로 JPA, Hibernate 등이 있다.)

### 장점
- 객체 지향적인 코드를 사용해 직관적이며 객체 단위로 접근하므로 생산성이 증가한다. 
- 선언문, 할당, 종료 같은 부수적인 코드가 없거나 줄어 가독성이 올라가 비즈니스 로직에 더 집중할 수 있다.
- DB에 종속적이지 않아 자료형 타입까지 유효하다. 따라서 개발자는 객체에 집중하여 극단적으로 DBMS를 교체하는 작업에서도 적은 리스크와 시간이 소요된다. 또한 오버라이드 같은 기능을 사용할 수 있어 간결하고 빠른 가공이 가능하다.

### 단점
- 프로젝트의 복잡성이 커질 경우 구현 난이도가 증가한다.
- 속도 저하 및 일관성이 무너지는 문제점이 발생될 수 있다.
- 프로시저가 많을 수록 객체 지향적이라는 장점이 사라진다.
